In [1]:
import pandas as pd
pd.pandas.set_option('display.max_columns',None)

In [4]:
df = pd.read_csv('../data/average-monthly-surface-temperature.csv')

df.head()

,Entity,Code,year,Day,Average surface temperature,Average surface temperature.1
0,Afghanistan,AFG,1940,1940-01-15,-2.032494,11.327695
1,Afghanistan,AFG,1940,1940-02-15,-0.733503,11.327695
2,Afghanistan,AFG,1940,1940-03-15,1.999134,11.327695
3,Afghanistan,AFG,1940,1940-04-15,10.199754,11.327695
4,Afghanistan,AFG,1940,1940-05-15,17.942135,11.327695

In [5]:
df.tail()

,Entity,Code,year,Day,Average surface temperature,Average surface temperature.1
198895,Zimbabwe,ZWE,2024,2024-08-15,20.559408,22.92125
198896,Zimbabwe,ZWE,2024,2024-09-15,23.642931,22.92125
198897,Zimbabwe,ZWE,2024,2024-10-15,24.407030,22.92125
198898,Zimbabwe,ZWE,2024,2024-11-15,25.672321,22.92125
198899,Zimbabwe,ZWE,2024,2024-12-15,27.019161,22.92125

In [6]:
df.describe()

,year,Average surface temperature,Average surface temperature.1
count,198900.00000,198900.000000,198900.000000
mean,1982.00000,18.072073,18.072073
std,24.53575,10.246142,8.710114
min,1940.00000,-36.240032,-21.529121
25%,1961.00000,12.304079,10.569263
50%,1982.00000,22.055794,21.856285
75%,2003.00000,25.317015,25.142885
max,2024.00000,39.889374,29.794220

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 198900 entries, 0 to 198899
Data columns (total 6 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   Entity                         198900 non-null  object
 1   Code                           198900 non-null  object
 2   year                           198900 non-null  int64
 3   Day                            198900 non-null  object
 4   Average surface temperature    198900 non-null  float64
 5   Average surface temperature.1  198900 non-null  float64
dtypes: float64(2), int64(1), object(3)
memory usage: 9.1+ MB

In [8]:
df.isnull().sum()

Entity                           0
Code                             0
year                             0
Day                              0
Average surface temperature      0
Average surface temperature.1    0
dtype: int64

In [9]:
df.nunique()

Entity                              195
Code                                195
year                                 85
Day                                1020
Average surface temperature      196959
Average surface temperature.1     16557
dtype: int64

In [10]:
df.duplicated().sum()

0

In [11]:
df.shape

(198900, 6)

In [ ]:
# About Dataset
# Description

# This Dataset contains details of Average Monthly surface temperature (1940-2024).
# Current climate change is primarily caused by human emissions of greenhouse gases.
# This warming can drive large changes in sea level, sea ice and glacier balances, rainfall patterns, and extreme temperatures.
# This has potentially devastating impacts on human health, farming systems, the stability of societies, and other species.

# Attribute Information

# Country Name : The name of the countries.
# Country Code : Code of the countries.
# Year : Years
# Day: Date
# Average surface temperature : Daily Average surface temperature
# Average surface temperature : Yearly Average surface temperature
# Acknowledgements

# https://data.worldbank.org/indicator